Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མངོན་པར་འདུ་བྱ་བ་དེ་དག་དང་། སེམས་བསྐྱེད་པ་དེ་དག་ཀྱང་འགགས་པར་གྱུར་ན། བདག་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་དང་། མངོན་པར་འདུ་བྱ་བ་དེ་དག་དང་། སེམས་བསྐྱེད་པ་དེ་དག་ལ་མཚན་མར་བྱས་ཤིང་རྣམ་པར་རྟོག་པ་ལྟ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ནི། དེ་ལྟར་མཚན་མའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོ་བ་ལ་རྗེས་སུ་དགྱེས་པ་དང་། མངོན་པར་བསྔགས་པ་མ་མཛད་དོ།
en: The tathāgatas, arhats, completely awakened buddhas do not approve of and do not praise those who make dedications by way of a distinguishing mark.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་རྣམས་མཚན་མར་བྱས་ཤིང་། རྣམ་པར་བརྟགས་ཏེ་དམིགས་པ་ནི། དེའི་དམིགས་པ་ཆེན་པོར་འགྱུར་ཏེ།
en: If you ask why, it is because they form a distinguishing mark of the lord buddhas who have passed into final nirvāṇa, conceiving of them and apprehending them, would become a major apprehending on their part.

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་བསྔོ་བར་འདོད་པས། མི་དམིགས་ཤིང་མཚན་མ་མེད་པར་བྱས་ཏེ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: So it is that bodhisattva great beings who wish to dedicate those roots of virtuous action should make their dedication, without apprehending anything and without making anything into a distinguishing mark.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ནི་དམིགས་པའི་འདུ་ཤེས་ཅན་དང་། མཚན་མའི་འདུ་ཤེས་ཅན་གྱི་ཡོངས་སུ་བསྔོ་བ་དེ་ནི་དོན་ཆེ་བར་མ་གསུངས་སོ།
en: The tathāgatas, arhats, completely awakened buddhas do not say that it is advantageous for this dedication to be made with an idea of apprehending or the idea of a distinguishing mark.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཡོངས་སུ་བསྔོ་བ་དེ་ནི་དུག་ཅན་ཟུག་རྔུ་ཅན་ཏེ།
en: If you ask why, that dedication would be poisonous and painful.

source: འདི་ལྟ་སྟེ་དཔེར་ན་ཁ་ཟས་བསོད་པ། ཁ་དོག་ཕུན་སུམ་ཚོགས་པ། དྲི་ཕུན་སུམ་ཚོགས་པ་ཞིག་ཡོད་ཀྱང་དུག་དང་འདྲེས་པར་གྱུར་ན། ཁ་དོག་དང་དྲི་དང་། རོ་ཡིད་དུ་འོང་བ་ཡང་ཡིན་མོད་ཀྱི་འོན་ཀྱང་དུག་ཅན་དུ་ཟད་ན། དེ་ལ་སྐྱེས་བུ་བྱིས་པའི་ངང་ཚུལ་ཅན། ཤེས་རབ་འཆལ་པའི་ངང་ཚུལ་ཅན་ནི་བཟའ་བར་སེམས་ཏེ། དེས་དེ་ཟོས་ན་ཡང་ཁ་དོག་དང་།
en: It would be just as when food, even though particularly good, of excellent color, and excellent aroma, has been mixed with poison—even though the color, aroma, and taste may well be pleasant, it nonetheless would end up being poisonous. {

source: དྲི་དང་།
en: Ki.

source: རོ་ཞིམ་པར་ཚོར་མོད་ཀྱི། སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་གྱི་རྣམ་པར་སྨིན་པར་འགྱུར་རོ།
en: II-III: 132} Persons of a childish disposition or of a nonsensical disposition might consider eating it but if they do indeed eat it, there will be suffering and the ripening of suffering. “

source: །དེ་བཞིན་དུ་འདི་ལ་ལོག་པར་རིག་པ་དང་། ལོག་པར་ཤེས་པ་དང་། ལོག་པར་བསླབས་པ་ལས་དོན་མ་རྟོགས་མི་ཤེས་ཤིང་འདི་སྐད་དུ་སྟོན་ཏེ། ཚུར་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འདས་པ་དང་། མ་བྱོན་པ་དང་།
en: Similarly, those who do not realize and do not understand the truth, apart from their wrong awareness, wrong cognition, and wrong training, will teach others as follows: ‘Come here, noble child.

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དང་། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དང་། དམ་པའི་ཆོས་ནུབ་པར་མ་གྱུར་གྱི་བར་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་མངོན་པར་འདུ་མཛད་པར་གྱུར་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: You should gather together, assimilate, and evaluate all the roots of virtuous action that the lord buddhas of the past, future, and present have gathered, [will gather, and are gathering,] after practicing the perfection of wisdom, commencing from the time when they first begin to set their mind on enlightenment until they attain consummate buddhahood in unsurpassed, complete enlightenment, until they pass into final nirvāṇa in the expanse of nirvāṇa where no aggregates are left behind, and for as long as their Dharma remains. [

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་དེ། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་མངོན་པར་འདུ་མཛད་པར་གྱུར་པ་དང་། མངོན་པར་འདུ་མཛད་པ་དང་། མངོན་པར་འདུ་མཛད་པར་འགྱུར་བ་དང་། བསམ་གཏན་བཞི་ལ་བསྒོམས་པ་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: You should gather together, assimilate, and evaluate] all the roots of virtuous action that they have gathered, will gather, and are gathering after practicing the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity. [

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་བསྒོམས་ཏེ། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་མངོན་པར་འདུ་མཛད་པར་གྱུར་པ་དང་། མངོན་པར་འདུ་མཛད་པ་དང་། མངོན་པར་འདུ་མཛད་པར་འགྱུར་བ་དང་། དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་མཛད་པ་གང་དག་གིས། སངས་རྒྱས་ཀྱི་ཞིང་མང་པོ་ཡོངས་སུ་དག་པར་གྱུར་པ་དང་། ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། སེམས་ཅན་མང་པོ་ཡོངས་སུ་སྨིན་པར་མཛད་པར་གྱུར་པ་དང་། ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། ཡོངས་སུ་སྨིན་པར་མཛད་པར་འགྱུར་བ་དང་།
en: You should gather together, assimilate, and evaluate] all the roots of virtuous action that they have gathered, will gather, and are gathering after cultivating the four meditative concentrations, and after cultivating the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas. [

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པའི་ཕུང་པོ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། མི་ཉམ་པའི་ཆོས་ཉིད་དང་། རྟག་ཏུ་བཏང་སྙོམས་སུ་གནས་པ་དང་། ཉན་ཐོས་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཟག་པ་མེད་པ་རྣམས་དང་། གང་གིས་དེར་དགེ་བའི་རྩ་བ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་གྱུར་པ་དང་། རྗེས་སུ་ཡི་རང་བ་དང་། རྗེས་སུ་ཡི་རང་བར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་རང་སངས་རྒྱས་རྣམས་ལུང་བསྟན་པར་གྱུར་པ་དང་། ལུང་བསྟན་པ་དང་།
en: You should gather together, assimilate, and evaluate] the roots of virtuous action that they have gathered, through which they have refined, will refine, and are refining many buddhafields, and through which they have brought to maturity, will bring to maturity, and are bringing to maturity many beings, as well as the aggregate of ethical discipline, the aggregate of meditative stability, the aggregate of wisdom, the aggregate of liberation, and the aggregate of seeing the wisdom of liberation that the lord buddhas have, their wisdom of all-aspect omniscience, their abiding in unimpaired reality, and their perpetual equanimity. [

source: ལུང་བསྟན་པར་འགྱུར་བ་དང་། དེར་ལྷ་དང་། ཀླུ་དང་གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་ནམ་མཁའ་ལྡིང་དང་མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དག་གིས་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་པ་དང་།
en: You should gather together, assimilate, and evaluate] the uncontaminated roots of virtuous action that those śrāvakas have and through which they have rejoiced, will rejoice, and are rejoicing in those [aforementioned] roots of virtuous actions; [all the roots of virtuous action of] the pratyekabuddhas who have been, will be, and are being prophesied by those lord buddhas; and all the roots of virtuous action that have been generated, will be generated, and are being generated by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: བསྐྱེད་པ་དང་། བསྐྱེད་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་མངོན་པར་བསྡུས་ཏེ། གཅིག་ཏུ་བརྟུལ་ལ་ཚད་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ཤིག་ཅེས་བྱ་བར་སྟོན་ཏེ།
en: You should dedicate these to unsurpassed, complete enlightenment!’ “

source: དེ་ལྟར་བསྔོ་བ་དེས་མཚན་མའི་ཚུལ་དང་དམིགས་པའི་ཚུལ་གྱིས་ཡོངས་སུ་བསྔོས་ན། དུག་དུ་འགྱུར་བ་ཡིན་ནོ། འདི་ལྟ་སྟེ་དཔེར་ན།
en: If such dedications are made by way of a distinguishing mark and by way of apprehending, they will be poisonous, just like that poisonous food.

source: ཟས་དུག་ཅན་དེ་དང་འདྲ་བར་དམིགས་པའི་འདུ་ཤེས་ཅན་ལ་ཡོངས་སུ་བསྔོ་བ་མེད་དོ།
en: There will be no dedication for those who harbor notions of apprehending.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དམིགས་པ་ནི་དུག་དང་བཅས་པ་སྟེ། མཚན་མ་དང་བཅས་པ། རྒྱུ་དང་བཅས་པ། རྐྱེན་དང་བཅས་པ་སྟེ།
en: If you ask why, apprehending is poisonous; it is associated with distinguishing marks, and with causes and conditions.

source: དེ་དེ་ལྟར་ཡོངས་སུ་བསྔོས་ན། དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་པར་འགྱུར། དེ་བཞིན་གཤེགས་པས་གསུངས་པ་བཞིན་དུ་སྨྲ་བ་ཡང་མ་ཡིན། ཆོས་བཞིན་དུ་སྨྲ་བ་ཡང་མ་ཡིན་པར་འགྱུར་ཏེ།
en: If dedications are made in that manner, one will deprecate the tathāgatas, one will not speak in accord with the teachings of the tathāgatas, and one will also not speak in accord with the Dharma.” {Ki.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོས་ཇི་ལྟར་ན་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དགེ་བའི་རྩ་བ་རྣམས་ལ་རྗེས་སུ་ཡི་རང་སྟེ། ཡོངས་སུ་བསྔོ་བར་བྱ། ཇི་ལྟར་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་འདས་པ་དང་། མ་བྱོན་པ་དང་།
en: II-III: 133} [Maitreya then asked], “How then should noble sons or noble daughters who follow the vehicle of the bodhisattvas make their dedication, rejoicing in the roots of virtuous action of the lord buddhas of the past, future, and present?

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་ཐུགས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དང་། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བར་དང་། དམ་པའི་ཆོས་ནུབ་པར་མ་གྱུར་གྱི་བར་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་མངོན་པར་འདུ་མཛད་པར་གྱུར་པ་དང་། མངོན་པར་འདུ་མཛད་པ་དང་། མངོན་པར་འདུ་མཛད་པར་འགྱུར་བ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: How should they rejoice in all the roots of virtuous action that the lord buddhas of the past, future, and present have gathered, will gather, and are gathering after practicing the perfection of wisdom, commencing from the time when they first begin to set their mind on enlightenment until they attain consummate buddhahood in unsurpassed, complete enlightenment, until they pass into final nirvāṇa in the expanse of nirvāṇa where no aggregates are left behind, and for as long as their Dharma remains? [

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་མངོན་པར་འདུ་མཛད་པར་གྱུར་པ་དང་། མངོན་པར་འདུ་མཛད་པ་དང་། མངོན་པར་འདུ་མཛད་པར་འགྱུར་བ་དང་། བསམ་གཏན་བཞི་ལ་བསྒོམས་པ་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་།
en: How should they rejoice in] all the roots of virtuous action that they have gathered, will gather, and are gathering after practicing the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity? [

source: མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་བསྒོམས་ཏེ། དགེ་བའི་རྩ་བ་གང་ཇི་སྙེད་ཅིག་མངོན་པར་འདུ་མཛད་པར་གྱུར་པ་དང་། མངོན་པར་འདུ་མཛད་པ་དང་། མངོན་པར་འདུ་མཛད་པར་འགྱུར་བ་དང་།
en: How should they rejoice in] all the roots of virtuous action that they have gathered, will gather, and are gathering after cultivating the four meditative concentrations, and after cultivating the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the thirty-seven factors conducive to enlightenment, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the [complete] extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas? [

source: དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་མཛད་པ་གང་དག་གིས། སངས་རྒྱས་ཀྱི་ཞིང་མང་པོ་ཡོངས་སུ་དག་པར་གྱུར་པ་དང་། ཡོངས་སུ་དག་པ་དང་། ཡོངས་སུ་དག་པར་འགྱུར་བ་དང་། སེམས་ཅན་མང་པོ་ཡོངས་སུ་སྨིན་པར་མཛད་པར་གྱུར་པ་དང་། ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་། ཡོངས་སུ་སྨིན་པར་མཛད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཚུལ་ཁྲིམས་ཀྱི་ཕུང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་ཕུང་པོ་དང་། ཤེས་རབ་ཀྱི་ཕུང་པོ་དང་།
en: How should they rejoice in] the roots of virtuous action that they have gathered, through which they have refined, will refine, and are refining many buddhafields, and through which they have brought to maturity, will bring to maturity and are bringing to maturity many beings? [

source: རྣམ་པར་གྲོལ་བའི་ཕུང་པོ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པའི་ཕུང་པོ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། མི་ཉམ་པའི་ཆོས་ཉིད་དང་། རྟག་ཏུ་བཏང་སྙོམས་སུ་གནས་པ་དང་།
en: How should they rejoice in] the aggregate of meditative stability, the aggregate of wisdom, the aggregate of liberation, and the aggregate of seeing the wisdom of liberation that the lord buddhas have, in their wisdom of all-aspect omniscience, their abiding in unimpaired reality, and their perpetual equanimity? [

source: ཉན་ཐོས་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཟག་པ་མེད་པ་རྣམས་དང་། གང་གིས་དེར་དགེ་བའི་རྩ་བ་དེ་དག་ལ་རྗེས་སུ་ཡི་རང་བར་གྱུར་པ་དང་། རྗེས་སུ་ཡི་རང་བ་དང་། རྗེས་སུ་ཡི་རང་བར་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས། རང་སངས་རྒྱས་རྣམས་
en: How should they rejoice in] the uncontaminated roots of virtuous action that those śrāvakas have and through which they have rejoiced, will rejoice, and are rejoicing in those [aforementioned] roots of virtuous actions? [

source: ལུང་བསྟན་པར་གྱུར་པ་དང་། ལུང་བསྟན་པ་དང་། ལུང་བསྟན་པར་འགྱུར་བ་དང་། དེ་ལྟར་ལྷ་དང་ཀླུ་དང་གནོད་སྦྱིན་དང་དྲི་ཟ་དང་ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་གིས་དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་པ་དང་།
en: How should they rejoice in] all the roots of virtuous action of] the pratyekabuddhas who have been, will be, and are being prophesied by those lord buddhas, and all the roots of virtuous action that have been generated, will be generated, and are being generated by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas?

source: བསྐྱེད་པ་དང་། བསྐྱེད་པར་འགྱུར་བ་རྣམས་ལ་རྗེས་སུ་ཡི་རང་སྟེ། ཡོངས་སུ་བསྔོས་ན་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པར་འགྱུར་བ་སྙམ་དུ་བསླབ་པར་མི་བྱའོ། །རབ་འབྱོར་གྱིས་སྨྲས་པ། བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ།
en: When they make their dedication, should they not train, thinking that they will dedicate those roots of virtuous action to unsurpassed, complete enlightenment?” “

source: རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ། དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་པར་འགྱུར་བ་མེད་པར་འདོད་པས། འདི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱ་སྟེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་བླ་ན་མེད་པས། དགེ་བའི་རྩ་བ་དེ་དག་གི་ངང་ཚུལ་གང་ཡིན་པ་དང་། རང་བཞིན་གང་ཡིན་པ་དང་། མཚན་ཉིད་གང་ཡིན་པ་ཐུགས་སུ་ཆུད་དེ། མཁྱེན་ལ་རབ་ཏུ་མཁྱེན་ཅིང་ཆོས་ཉིད་གང་གིས་ཡོད་པ་དེ་བཞིན་དུ།
en: Maitreya,” replied Subhūti, “in this regard, noble sons or noble daughters who follow the vehicle of the bodhisattvas, who practice the perfection of wisdom, and who do not wish to deprecate the tathāgatas should make their dedication in the following manner: ‘Just as those tathāgatas, arhats, completely awakened buddhas comprehend, through the unsurpassed wisdom of the buddhas, exactly what is the disposition of those roots of virtuous action, what is their intrinsic nature, and what is their defining characteristic, inasmuch as they know them, thoroughly know them, and discern them on the basis of reality itself, I should rejoice!

source: བདག་གིས་རྗེས་སུ་ཡི་རང་བར་བྱའོ། ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཐུགས་སུ་ཆུད་པ་དེ་བཞིན་དུ། བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ་ཞེས།
en: Just as the lord buddhas comprehend them, I will dedicate them to unsurpassed, complete enlightenment!’ “

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བར་བྱ་སྟེ།
en: It is in this manner that the noble sons or noble daughters who follow the vehicle of the bodhisattvas should dedicate those roots of virtuous action to unsurpassed, complete enlightenment.

source: དེ་ལྟར་ཡོངས་སུ་བསྔོས་ན། དེ་བཞིན་གཤེགས་པ་ལ་སྐུར་བར་མི་འགྱུར། དེ་བཞིན་གཤེགས་པས་གསུངས་པ་བཞིན་དུ་སྨྲ་བ་དང་། ཆོས་བཞིན་དུ་སྨྲ་བར་འགྱུར་རོ།
en: When they make their dedication in that way, they will not deprecate the tathāgatas, they will speak in accord with the teachings of the tathāgatas, and they will speak in accord with the Dharma.

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡོངས་སུ་བསྔོ་བ་དེ་དུག་མེད་ཅིང་བདུད་རྩིའི་མཐར་ཕྱིན་པར་འགྱུར་རོ།
en: The dedications of bodhisattva great beings who practice in that manner are nonpoisonous and perfectly replete with nectar. “

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་འམ། །རིགས་ཀྱི་བུ་མོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ།
en: Moreover, when noble sons or noble daughters who adhere to the vehicle of the bodhisattvas {Ki.

source: དགེ་བའི་རྩ་བ་རྣམས་འདི་ལྟར་ཡོངས་སུ་བསྔོ་བར་བྱ་སྟེ། ཇི་ལྟར་གཟུགས་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ།
en: II-III:134} practice the perfection of wisdom, they should dedicate the roots of virtuous action in the following manner: Just as physical forms are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །སྐྱེ་མཆེད་རྣམས་དང་། ཁམས་རྣམས་དང་།
en: Just as feelings, perceptions, formative predispositions, and consciousness are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ།
en: Just as the sense fields, the sensory elements, and the links of dependent origination are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Just as the perfection of wisdom is not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །ནང་སྟོང་པ་ཉིད་དང་།
en: Just as the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ།
en: Just as the emptiness of internal phenomena and the [other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་ཀྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་།
en: Just as the thirty-seven factors conducive to enlightenment are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་འདོད་པའི་ཁམས་དང་། གཟུགས་ཀྱི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་ཏེ། གང་ཁོངས་སུ་ཆུད་པ་མ་ཡིན་པ་དེ་ནི་འདས་པ་ཡང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ། །དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་ཀྱི་གནས་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་།
en: Just as the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, [great loving kindness], great compassion, and the eighteen distinct qualities of the buddhas are not included within the realm of desire, the realm of form, or the realm of formlessness, that which is not included in them is neither past, nor future, nor present.
